In [1]:
# https://pandas.pydata.org/

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.46210752, -1.7155897 , -0.86605382],
       [ 0.26753813,  1.26361976, -0.28654579],
       [-1.118614  , -0.68010247,  1.66558867],
       [ 1.04431692, -0.07761708, -0.36117021]])

In [6]:
data_frame = pd.DataFrame(data)

In [7]:
data_frame

          0         1         2
0  0.462108 -1.715590 -0.866054
1  0.267538  1.263620 -0.286546
2 -1.118614 -0.680102  1.665589
3  1.044317 -0.077617 -0.361170

In [8]:
type(data_frame)

pandas.DataFrame

In [9]:
type(data_frame[0])

pandas.Series

In [10]:
new_df = pd.DataFrame(data, index = ["Safiye", "Haluk", "Saadet", "Atif"], columns = ["Salary", "Age", "Seniority"])

In [11]:
new_df

          Salary       Age  Seniority
Safiye  0.462108 -1.715590  -0.866054
Haluk   0.267538  1.263620  -0.286546
Saadet -1.118614 -0.680102   1.665589
Atif    1.044317 -0.077617  -0.361170

In [12]:
new_df[["Age", "Salary"]]

             Age    Salary
Safiye -1.715590  0.462108
Haluk   1.263620  0.267538
Saadet -0.680102 -1.118614
Atif   -0.077617  1.044317

In [13]:
new_df.loc["Atif"]

Salary       1.044317
Age         -0.077617
Seniority   -0.361170
Name: Atif, dtype: float64

In [14]:
new_df.iloc[0] # row

Salary       0.462108
Age         -1.715590
Seniority   -0.866054
Name: Safiye, dtype: float64

In [15]:
new_df.iloc[:,2] # : -> all row ,[i] -> choice of column

Safiye   -0.866054
Haluk    -0.286546
Saadet    1.665589
Atif     -0.361170
Name: Seniority, dtype: float64

In [16]:
new_df["Extra"] = 10

In [17]:
new_df

          Salary       Age  Seniority  Extra
Safiye  0.462108 -1.715590  -0.866054     10
Haluk   0.267538  1.263620  -0.286546     10
Saadet -1.118614 -0.680102   1.665589     10
Atif    1.044317 -0.077617  -0.361170     10

In [18]:
new_df.drop("Extra", axis=1, inplace=True)

In [19]:
new_df

          Salary       Age  Seniority
Safiye  0.462108 -1.715590  -0.866054
Haluk   0.267538  1.263620  -0.286546
Saadet -1.118614 -0.680102   1.665589
Atif    1.044317 -0.077617  -0.361170

In [20]:
new_df.loc["Saadet", "Salary"] = 100

In [21]:
new_df

            Salary       Age  Seniority
Safiye    0.462108 -1.715590  -0.866054
Haluk     0.267538  1.263620  -0.286546
Saadet  100.000000 -0.680102   1.665589
Atif      1.044317 -0.077617  -0.361170

In [22]:
new_df > 0

        Salary    Age  Seniority
Safiye    True  False      False
Haluk     True   True      False
Saadet    True  False       True
Atif      True  False      False

In [23]:
# index

In [24]:
reset_frame = new_df.reset_index()

In [25]:
reset_frame

    index      Salary       Age  Seniority
0  Safiye    0.462108 -1.715590  -0.866054
1   Haluk    0.267538  1.263620  -0.286546
2  Saadet  100.000000 -0.680102   1.665589
3    Atif    1.044317 -0.077617  -0.361170

In [26]:
new_df

            Salary       Age  Seniority
Safiye    0.462108 -1.715590  -0.866054
Haluk     0.267538  1.263620  -0.286546
Saadet  100.000000 -0.680102   1.665589
Atif      1.044317 -0.077617  -0.361170

In [27]:
new_indices = ["Saf", "Hal", "Sdt", "Atf"]

In [28]:
new_df["NewIndex"] = new_indices

In [29]:
new_df.set_index("NewIndex", inplace=True)

In [30]:
new_df

              Salary       Age  Seniority
NewIndex
Saf         0.462108 -1.715590  -0.866054
Hal         0.267538  1.263620  -0.286546
Sdt       100.000000 -0.680102   1.665589
Atf         1.044317 -0.077617  -0.361170

In [31]:
# multi index

In [32]:
first_index = ["Kral Sakir", "Kral Sakir", "Kral Sakir", "Rafadan Tayfa", "Rafadan Tayfa", "Rafadan Tayfa"]

In [33]:
inner_index = ["Sakir", "Necati", "Canan", "Akin", "Hayri", "Mert"]

In [34]:
zipped_index = list(zip(first_index, inner_index))

In [35]:
zipped_index

[('Kral Sakir', 'Sakir'),
 ('Kral Sakir', 'Necati'),
 ('Kral Sakir', 'Canan'),
 ('Rafadan Tayfa', 'Akin'),
 ('Rafadan Tayfa', 'Hayri'),
 ('Rafadan Tayfa', 'Mert')]

In [36]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [37]:
zipped_index

MultiIndex([(   'Kral Sakir',  'Sakir'),
            (   'Kral Sakir', 'Necati'),
            (   'Kral Sakir',  'Canan'),
            ('Rafadan Tayfa',   'Akin'),
            ('Rafadan Tayfa',  'Hayri'),
            ('Rafadan Tayfa',   'Mert')],
           )

In [38]:
samples_values = np.ones((6,2))

In [39]:
big_df = pd.DataFrame(samples_values, index=zipped_index, columns = ["Age", "Salary"])

In [40]:
big_df

                      Age  Salary
Kral Sakir    Sakir   1.0     1.0
              Necati  1.0     1.0
              Canan   1.0     1.0
Rafadan Tayfa Akin    1.0     1.0
              Hayri   1.0     1.0
              Mert    1.0     1.0

In [41]:
big_df.loc["Kral Sakir"].loc["Sakir"]

Age       1.0
Salary    1.0
Name: Sakir, dtype: float64